var major_list = [
    {
        "key": "不限",
        "value": []
    },
    {
        "key": "哲学",
        "value": [
            {
                "key": "哲学类",
                "value": [
                    "哲学类",
                    "哲学",
                    "逻辑学",
                    "宗教学",
                    "伦理学"
                ]
            },
            {
                "key": "人文科学试验班类",
                "value": [
                    "人文科学试验班类"
                ]
            },
            {
                "key": "哲学",
                "value": [
                    "哲学",
                    "马克思主义哲学",
                    "中国哲学",
                    "外国哲学",
                    "逻辑学",
                    "伦理学",
                    "美学",
                    "宗教学",
                    "科学技术哲学"
                ]
            }
        ]
    },
    {
        "key": "经济学",
        "value": [
            {
                "key": "经济学类",
                "value": [
                    "经济学类",
                    "经济学",
                    "经济统计学",
                    "国民经济管理",
                    "资源与环境经济学",
                    "商务经济学",
                    "能源经济"
                ]
            },
            {
                "key": "财政学类",
                "value": [
                    "财政学类",
                    "财政学",
                    "税收学"
                ]
            },
            {
                "key": "金融学类",
                "value": [
                    "金融学类",
                    "金融学",
                    "金融工程",
                    "保险学",
                    "投资学",
                    "金融数学",
                    "信用管理",
                    "经济与金融"
                ]
            },
            {
                "key": "经济与贸易类",
                "value": [
                    "经济与贸易类",
                    "国际经济与贸易",
                    "贸易经济"
                ]
            },
            {
                "key": "理论经济学",
                "value": [
                    "理论经济学",
                    "政治经济学",
                    "经济思想史",
                    "经济史",
                    "西方经济学",
                    "世界经济",
                    "人口、资源与环境经济学"
                ]
            },
            {
                "key": "应用经济学",
                "value": [
                    "应用经济学",
                    "国民经济学",
                    "区域经济学",
                    "财政学",
                    "金融学",
                    "产业经济学",
                    "国际贸易学",
                    "劳动经济学",
                    "统计学",
                    "数量经济学",
                    "国防经济"
                ]
            },
            {
                "key": "统计学",
                "value": [
                    "统计学"
                ]
            },
            {
                "key": "金融",
                "value": [
                    "金融"
                ]
            },
            {
                "key": "应用统计",
                "value": [
                    "应用统计"
                ]
            },
            {
                "key": "税务",
                "value": [
                    "税务"
                ]
            },
            {
                "key": "国际商务",
                "value": [
                    "国际商务"
                ]
            },
            {
                "key": "保险",
                "value": [
                    "保险"
                ]
            },
            {
                "key": "资产评估",
                "value": [
                    "资产评估"
                ]
            },
            {
                "key": "审计",
                "value": [
                    "审计"
                ]
            }
        ]
    },
    {
        "key": "法学",
        "value": [
            {
                "key": "法学类",
                "value": [
                    "法学类",
                    "法学",
                    "知识产权",
                    "监狱学"
                ]
            },
            {
                "key": "政治学类",
                "value": [
                    "政治学类",
                    "政治学与行政学",
                    "国际政治",
                    "外交学",
                    "国际事务与国际关系",
                    "政治学、经济学和哲学"
                ]
            },
            {
                "key": "社会学类",
                "value": [
                    "社会学类",
                    "社会学",
                    "社会工作",
                    "人类学",
                    "女性学",
                    "家政学"
                ]
            },
            {
                "key": "民族学类",
                "value": [
                    "民族学类",
                    "民族学"
                ]
            },
            {
                "key": "马克思主义理论类",
                "value": [
                    "马克思主义理论类",
                    "科学社会主义",
                    "中国共产党历史",
                    "思想政治教育"
                ]
            },
            {
                "key": "公安学类",
                "value": [
                    "公安学类",
                    "治安学",
                    "侦查学",
                    "边防管理",
                    "禁毒学",
                    "警犬技术",
                    "经济犯罪侦查",
                    "边防指挥",
                    "消防指挥",
                    "警卫学",
                    "公安情报学",
                    "犯罪学",
                    "公安管理学",
                    "涉外警务",
                    "国内安全保卫",
                    "警务指挥与战术"
                ]
            },
            {
                "key": "法学试验班类",
                "value": [
                    "法学试验班类"
                ]
            },
            {
                "key": "法学",
                "value": [
                    "法学",
                    "法学理论",
                    "法律史",
                    "宪法学与行政法学",
                    "刑法学",
                    "民商法学",
                    "诉讼法学",
                    "经济法学",
                    "环境与资源保护法学",
                    "国际法学",
                    "军事法学"
                ]
            },
            {
                "key": "政治学",
                "value": [
                    "政治学",
                    "政治学理论",
                    "中外政治制度",
                    "科学社会主义与国际共产主义运动",
                    "中共党史",
                    "国际政治",
                    "国际关系",
                    "外交学"
                ]
            },
            {
                "key": "社会学",
                "value": [
                    "社会学",
                    "人口学",
                    "人类学",
                    "民俗学"
                ]
            },
            {
                "key": "民族学",
                "value": [
                    "民族学",
                    "马克思主义民族理论与政策",
                    "中国少数民族经济",
                    "中国少数民族史",
                    "中国少数民族艺术"
                ]
            },
            {
                "key": "马克思主义理论",
                "value": [
                    "马克思主义理论",
                    "马克思主义基本原理",
                    "马克思主义发展史",
                    "马克思主义中国化研究",
                    "国外马克思主义研究",
                    "思想政治教育",
                    "中国近现代史基本问题研究"
                ]
            },
            {
                "key": "公安学",
                "value": [
                    "公安学"
                ]
            },
            {
                "key": "教育学",
                "value": [
                    "教育学",
                    "教育学原理",
                    "课程与教学论",
                    "教育史",
                    "比较教育学",
                    "学前教育学",
                    "高等教育学",
                    "成人教育学",
                    "职业技术教育学",
                    "特殊教育学",
                    "教育技术学",
                    "教育法学"
                ]
            },
            {
                "key": "心理学",
                "value": [
                    "心理学",
                    "基础心理学",
                    "发展与教育心理学",
                    "应用心理学"
                ]
            },
            {
                "key": "体育学",
                "value": [
                    "体育学",
                    "体育人文社会学",
                    "运动人体科学",
                    "体育教育训练学",
                    "民族传统体育学"
                ]
            },
            {
                "key": "法律",
                "value": [
                    "法律",
                    "法律（非法学）",
                    "法律（法学）"
                ]
            },
            {
                "key": "社会工作",
                "value": [
                    "社会工作"
                ]
            },
            {
                "key": "警务",
                "value": [
                    "警务"
                ]
            }
        ]
    },
    {
        "key": "教育学",
        "value": [
            {
                "key": "教育学类",
                "value": [
                    "教育学类",
                    "教育学",
                    "科学教育",
                    "人文教育",
                    "教育技术学",
                    "艺术教育",
                    "学前教育",
                    "小学教育",
                    "特殊教育",
                    "华文教育"
                ]
            },
            {
                "key": "体育学类",
                "value": [
                    "体育学类",
                    "体育教育",
                    "运动训练",
                    "社会体育指导与管理",
                    "武术与民族传统体育",
                    "运动人体科学",
                    "运动康复",
                    "休闲体育"
                ]
            },
            {
                "key": "职业技术教育类",
                "value": [
                    "职业技术教育类"
                ]
            },
            {
                "key": "教育",
                "value": [
                    "职业技术教育",
                    "教育",
                    "教育管理",
                    "学科教学（思政）",
                    "学科教学（语文）",
                    "学科教学（数学）",
                    "学科教学（物理）",
                    "学科教学（化学）",
                    "学科教学（生物）",
                    "学科教学（英语）",
                    "学科教学（历史）",
                    "学科教学（地理）",
                    "学科教学（音乐）",
                    "学科教学（体育）",
                    "学科教学（美术）",
                    "现代教育技术",
                    "小学教育",
                    "心理健康教育",
                    "科学与技术教育",
                    "学前教育",
                    "特殊教育",
                    "学校课程与教学",
                    "学生发展与教育",
                    "教育领导与管理"
                ]
            },
            {
                "key": "体育",
                "value": [
                    "体育",
                    "体育教学",
                    "运动训练",
                    "竞赛组织",
                    "社会体育指导"
                ]
            },
            {
                "key": "汉语国际教育",
                "value": [
                    "汉语国际教育"
                ]
            },
            {
                "key": "应用心理",
                "value": [
                    "应用心理"
                ]
            }
        ]
    },
    {
        "key": "文学",
        "value": [
            {
                "key": "中国语言文学类",
                "value": [
                    "中国语言文学类",
                    "汉语言文学",
                    "汉语言",
                    "汉语国际教育",
                    "中国少数民族语言文学",
                    "古典文献学",
                    "应用语言学",
                    "秘书学"
                ]
            },
            {
                "key": "外国语言文学类",
                "value": [
                    "外国语言文学类",
                    "英语",
                    "俄语",
                    "德语",
                    "法语",
                    "西班牙语",
                    "阿拉伯语",
                    "日语",
                    "波斯语",
                    "朝鲜语",
                    "菲律宾语",
                    "梵语巴利语",
                    "印度尼西亚语",
                    "印地语",
                    "柬埔寨语",
                    "老挝语",
                    "缅甸语",
                    "马来语",
                    "蒙古语",
                    "僧加罗语",
                    "泰语",
                    "乌尔都语",
                    "希伯莱语",
                    "越南语",
                    "豪萨语",
                    "斯瓦希里语",
                    "阿尔巴尼亚语",
                    "保加利亚语",
                    "波兰语",
                    "捷克语",
                    "斯洛伐克语",
                    "罗马尼亚语",
                    "葡萄牙语",
                    "瑞典语",
                    "塞尔维亚语",
                    "土耳其语",
                    "希腊语",
                    "匈牙利语",
                    "意大利语",
                    "泰米尔语",
                    "普什图语",
                    "世界语",
                    "孟加拉语",
                    "尼泊尔语",
                    "克罗地亚语",
                    "荷兰语",
                    "芬兰语",
                    "乌克兰语",
                    "挪威语",
                    "丹麦语",
                    "冰岛语",
                    "爱尔兰语",
                    "拉脱维亚语",
                    "立陶宛语",
                    "斯洛文尼亚语",
                    "爱沙尼亚语",
                    "马耳他语",
                    "哈萨克语",
                    "乌兹别克语",
                    "祖鲁语",
                    "拉丁语",
                    "翻译",
                    "商务英语"
                ]
            },
            {
                "key": "新闻传播学类",
                "value": [
                    "新闻传播学类",
                    "新闻学",
                    "广播电视学",
                    "广告学",
                    "传播学",
                    "编辑出版学",
                    "网络与新媒体",
                    "数字出版"
                ]
            },
            {
                "key": "文科试验班类",
                "value": [
                    "文科试验班类"
                ]
            },
            {
                "key": "中国语言文学",
                "value": [
                    "中国语言文学",
                    "文艺学",
                    "语言学及应用语言学",
                    "汉语言文字学",
                    "中国古典文献学",
                    "中国古代文学",
                    "中国现当代文学",
                    "中国少数民族语言文学",
                    "比较文学与世界文学"
                ]
            },
            {
                "key": "外国语言文学",
                "value": [
                    "外国语言文学",
                    "英语语言文学",
                    "俄语语言文学",
                    "法语语言文学",
                    "德语语言文学",
                    "日语语言文学",
                    "印度语言文学",
                    "西班牙语语言文学",
                    "阿拉伯语语言文学",
                    "欧洲语言文学",
                    "亚非语言文学",
                    "外国语言学及应用语言学"
                ]
            },
            {
                "key": "新闻传播学",
                "value": [
                    "新闻传播学",
                    "新闻学",
                    "传播学"
                ]
            },
            {
                "key": "翻译",
                "value": [
                    "西班牙语笔译",
                    "西班牙语口译",
                    "阿拉伯语笔译",
                    "阿拉伯语口译",
                    "泰语笔译",
                    "泰语口译",
                    "翻译",
                    "英语笔译",
                    "英语口译",
                    "俄语笔译",
                    "俄语口译",
                    "日语笔译",
                    "日语口译",
                    "法语笔译",
                    "法语口译",
                    "德语笔译",
                    "德语口译",
                    "朝鲜语笔译",
                    "朝鲜语口译"
                ]
            },
            {
                "key": "新闻与传播",
                "value": [
                    "新闻与传播"
                ]
            },
            {
                "key": "出版",
                "value": [
                    "出版"
                ]
            }
        ]
    },
    {
        "key": "历史学",
        "value": [
            {
                "key": "历史学类",
                "value": [
                    "历史学类",
                    "历史学",
                    "世界史",
                    "考古学",
                    "文物与博物馆学",
                    "文物保护技术",
                    "外国语言与外国历史"
                ]
            },
            {
                "key": "考古学",
                "value": [
                    "考古学",
                    "考古学及博物馆学"
                ]
            },
            {
                "key": "中国史",
                "value": [
                    "历史地理学",
                    "中国史",
                    "史学理论及史学史",
                    "历史文献学（含∶敦煌学、古文字学）",
                    "专门史",
                    "中国古代史",
                    "中国近现代史"
                ]
            },
            {
                "key": "世界史",
                "value": [
                    "世界史"
                ]
            },
            {
                "key": "文物与博物馆",
                "value": [
                    "文物与博物馆"
                ]
            }
        ]
    },
    {
        "key": "理学",
        "value": [
            {
                "key": "数学类",
                "value": [
                    "数学类",
                    "数学与应用数学",
                    "信息与计算科学",
                    "数理基础科学"
                ]
            },
            {
                "key": "物理学类",
                "value": [
                    "物理学类",
                    "物理学",
                    "应用物理学",
                    "核物理",
                    "声学"
                ]
            },
            {
                "key": "化学类",
                "value": [
                    "化学类",
                    "化学",
                    "应用化学",
                    "化学生物学",
                    "分子科学与工程"
                ]
            },
            {
                "key": "天文学类",
                "value": [
                    "天文学类",
                    "天文学"
                ]
            },
            {
                "key": "地理科学类",
                "value": [
                    "地理科学类",
                    "地理科学",
                    "自然地理与资源环境",
                    "人文地理与城乡规划",
                    "地理信息科学"
                ]
            },
            {
                "key": "大气科学类",
                "value": [
                    "大气科学类",
                    "大气科学",
                    "应用气象学"
                ]
            },
            {
                "key": "海洋科学类",
                "value": [
                    "海洋科学类",
                    "海洋科学",
                    "海洋技术",
                    "海洋资源与环境",
                    "军事海洋学"
                ]
            },
            {
                "key": "地球物理学类",
                "value": [
                    "地球物理学类",
                    "地球物理学",
                    "空间科学与技术"
                ]
            },
            {
                "key": "地质学类",
                "value": [
                    "地质学类",
                    "地质学",
                    "地球化学",
                    "地球信息科学与技术",
                    "古生物学"
                ]
            },
            {
                "key": "生物科学类",
                "value": [
                    "生物科学类",
                    "生物科学",
                    "生物技术",
                    "生物信息学",
                    "生态学"
                ]
            },
            {
                "key": "心理学类",
                "value": [
                    "心理学类",
                    "心理学",
                    "应用心理学"
                ]
            },
            {
                "key": "统计学类",
                "value": [
                    "统计学类",
                    "统计学",
                    "应用统计学"
                ]
            },
            {
                "key": "理科试验班类",
                "value": [
                    "理科试验班类"
                ]
            },
            {
                "key": "数学",
                "value": [
                    "数学",
                    "基础数学",
                    "计算数学",
                    "概率论与数理统计",
                    "应用数学",
                    "运筹学与控制论"
                ]
            },
            {
                "key": "物理学",
                "value": [
                    "物理学",
                    "理论物理",
                    "粒子物理与原子核物理",
                    "原子与分子物理",
                    "等离子体物理",
                    "凝聚态物理",
                    "声学",
                    "光学",
                    "无线电物理"
                ]
            },
            {
                "key": "化学",
                "value": [
                    "化学",
                    "无机化学",
                    "分析化学",
                    "有机化学",
                    "物理化学",
                    "高分子化学与物理"
                ]
            },
            {
                "key": "天文学",
                "value": [
                    "天文学",
                    "天体物理",
                    "天体测量与天体力学"
                ]
            },
            {
                "key": "地理学",
                "value": [
                    "地理学",
                    "自然地理学",
                    "人文地理学",
                    "地图学与地理信息系统"
                ]
            },
            {
                "key": "大气科学",
                "value": [
                    "大气科学",
                    "气象学",
                    "大气物理学与大气环境"
                ]
            },
            {
                "key": "海洋科学",
                "value": [
                    "海洋科学",
                    "物理海洋学",
                    "海洋化学",
                    "海洋生物学",
                    "海洋地质"
                ]
            },
            {
                "key": "地球物理学",
                "value": [
                    "地球物理学",
                    "固体地球物理学",
                    "空间物理学"
                ]
            },
            {
                "key": "地质学",
                "value": [
                    "地质学",
                    "矿物学、岩石学、矿床学",
                    "地球化学",
                    "古生物学与地层学",
                    "构造地质学",
                    "第四纪地质学"
                ]
            },
            {
                "key": "生物学",
                "value": [
                    "生物学",
                    "植物学",
                    "动物学",
                    "生理学",
                    "水生生物学",
                    "微生物学",
                    "神经生物学",
                    "遗传学",
                    "发育生物学",
                    "细胞生物学",
                    "生物化学与分子生物学",
                    "生物物理学"
                ]
            },
            {
                "key": "系统科学",
                "value": [
                    "系统科学",
                    "系统理论",
                    "系统分析与集成"
                ]
            },
            {
                "key": "科学技术史",
                "value": [
                    "科学技术史"
                ]
            },
            {
                "key": "生态学",
                "value": [
                    "生态学"
                ]
            },
            {
                "key": "统计学",
                "value": [
                    "统计学"
                ]
            },
            {
                "key": "心理学",
                "value": [
                    "心理学",
                    "基础心理学",
                    "发展与教育心理学",
                    "应用心理学"
                ]
            },
            {
                "key": "力学",
                "value": [
                    "力学",
                    "一般力学与力学基础",
                    "固体力学",
                    "流体力学",
                    "工程力学"
                ]
            },
            {
                "key": "材料科学与工程",
                "value": [
                    "材料科学与工程",
                    "材料物理与化学",
                    "材料学",
                    "材料加工工程"
                ]
            },
            {
                "key": "电子科学与技术",
                "value": [
                    "电子科学与技术",
                    "物理电子学",
                    "电路与系统",
                    "微电子学与固体电子学",
                    "电磁场与微波技术"
                ]
            },
            {
                "key": "计算机科学与技术",
                "value": [
                    "计算机科学与技术",
                    "计算机系统结构",
                    "计算机软件与理论",
                    "计算机应用技术"
                ]
            },
            {
                "key": "环境科学与工程",
                "value": [
                    "环境科学与工程",
                    "环境科学",
                    "环境工程"
                ]
            },
            {
                "key": "生物医学工程",
                "value": [
                    "生物医学工程"
                ]
            },
            {
                "key": "基础医学",
                "value": [
                    "基础医学",
                    "人体解剖与组织胚胎学",
                    "免疫学",
                    "病原生物学",
                    "病理学与病理生理学",
                    "法医学",
                    "放射医学"
                ]
            },
            {
                "key": "公共卫生与预防医学",
                "value": [
                    "公共卫生与预防医学",
                    "流行病与卫生统计学",
                    "劳动卫生与环境卫生学",
                    "营养与食品卫生学",
                    "儿少卫生与妇幼保健学",
                    "卫生毒理学",
                    "军事预防医学"
                ]
            },
            {
                "key": "药学",
                "value": [
                    "药学",
                    "药物化学",
                    "药剂学",
                    "生药学",
                    "药物分析学",
                    "微生物与生化药学",
                    "药理学"
                ]
            },
            {
                "key": "中药学",
                "value": [
                    "中药学"
                ]
            },
            {
                "key": "医学技术",
                "value": [
                    "医学技术"
                ]
            },
            {
                "key": "护理学",
                "value": [
                    "护理学"
                ]
            }
        ]
    },
    {
        "key": "工学",
        "value": [
            {
                "key": "力学类",
                "value": [
                    "力学类",
                    "理论与应用力学",
                    "工程力学"
                ]
            },
            {
                "key": "机械类",
                "value": [
                    "机械类",
                    "机械工程",
                    "机械设计制造及其自动化",
                    "材料成型及控制工程",
                    "机械电子工程",
                    "工业设计",
                    "过程装备与控制工程",
                    "车辆工程",
                    "汽车服务工程",
                    "机械工艺技术",
                    "微机电系统工程",
                    "机电技术教育",
                    "汽车维修工程教育"
                ]
            },
            {
                "key": "仪器类",
                "value": [
                    "仪器类",
                    "测控技术与仪器"
                ]
            },
            {
                "key": "材料类",
                "value": [
                    "材料类",
                    "材料科学与工程",
                    "材料物理",
                    "材料化学",
                    "冶金工程",
                    "金属材料工程",
                    "无机非金属材料工程",
                    "高分子材料与工程",
                    "复合材料与工程",
                    "粉体材料科学与工程",
                    "宝石及材料工艺学",
                    "焊接技术与工程",
                    "功能材料",
                    "纳米材料与技术",
                    "新能源材料与器件"
                ]
            },
            {
                "key": "能源动力类",
                "value": [
                    "能源动力类",
                    "能源与动力工程",
                    "能源与环境系统工程",
                    "新能源科学与工程"
                ]
            },
            {
                "key": "电气类",
                "value": [
                    "电气类",
                    "电气工程及其自动化",
                    "智能电网信息工程",
                    "光源与照明",
                    "电气工程与智能控制"
                ]
            },
            {
                "key": "电子信息类",
                "value": [
                    "电子信息类",
                    "电子信息工程",
                    "电子科学与技术",
                    "通信工程",
                    "微电子科学与工程",
                    "光电信息科学与工程",
                    "信息工程",
                    "广播电视工程",
                    "水声工程",
                    "电子封装技术",
                    "集成电路设计与集成系统",
                    "医学信息工程",
                    "电磁场与无线技术",
                    "电波传播与天线",
                    "电子信息科学与技术",
                    "电信工程及管理",
                    "应用电子技术教育"
                ]
            },
            {
                "key": "自动化类",
                "value": [
                    "自动化类",
                    "自动化",
                    "轨道交通信号与控制"
                ]
            },
            {
                "key": "计算机类",
                "value": [
                    "计算机类",
                    "计算机科学与技术",
                    "软件工程",
                    "网络工程",
                    "信息安全",
                    "物联网工程",
                    "数字媒体技术",
                    "智能科学与技术",
                    "空间信息与数字技术",
                    "电子与计算机工程"
                ]
            },
            {
                "key": "土木类",
                "value": [
                    "土木类",
                    "土木工程",
                    "建筑环境与能源应用工程",
                    "给排水科学与工程",
                    "建筑电气与智能化",
                    "城市地下空间工程",
                    "道路桥梁与渡河工程"
                ]
            },
            {
                "key": "水利类",
                "value": [
                    "水利类",
                    "水利水电工程",
                    "水文与水资源工程",
                    "港口航道与海岸工程",
                    "水务工程"
                ]
            },
            {
                "key": "测绘类",
                "value": [
                    "测绘类",
                    "测绘工程",
                    "遥感科学与技术",
                    "导航工程",
                    "地理国情监测"
                ]
            },
            {
                "key": "化工与制药类",
                "value": [
                    "化工与制药类",
                    "化学工程与工艺",
                    "制药工程",
                    "资源循环科学与工程",
                    "能源化学工程",
                    "化学工程与工业生物工程"
                ]
            },
            {
                "key": "地质类",
                "value": [
                    "地质类",
                    "地质工程",
                    "勘查技术与工程",
                    "资源勘查工程",
                    "地下水科学与工程"
                ]
            },
            {
                "key": "矿业类",
                "value": [
                    "矿业类",
                    "采矿工程",
                    "石油工程",
                    "矿物加工工程",
                    "油气储运工程",
                    "矿物资源工程",
                    "海洋油气工程"
                ]
            },
            {
                "key": "纺织类",
                "value": [
                    "纺织类",
                    "纺织工程",
                    "服装设计与工程",
                    "非织造材料与工程",
                    "服装设计与工艺教育"
                ]
            },
            {
                "key": "轻工类",
                "value": [
                    "轻工类",
                    "轻化工程",
                    "包装工程",
                    "印刷工程"
                ]
            },
            {
                "key": "交通运输类",
                "value": [
                    "交通运输类",
                    "交通运输",
                    "交通工程",
                    "航海技术",
                    "轮机工程",
                    "飞行技术",
                    "交通设备与控制工程",
                    "救助与打捞工程",
                    "船舶电子电气工程"
                ]
            },
            {
                "key": "海洋工程类",
                "value": [
                    "海洋工程类",
                    "船舶与海洋工程",
                    "海洋工程与技术",
                    "海洋资源开发技术"
                ]
            },
            {
                "key": "航空航天类",
                "value": [
                    "航空航天类",
                    "航空航天工程",
                    "飞行器设计与工程",
                    "飞行器制造工程",
                    "飞行器动力工程",
                    "飞行器环境与生命保障工程",
                    "飞行器质量与可靠性",
                    "飞行器适航技术"
                ]
            },
            {
                "key": "兵器类",
                "value": [
                    "兵器类",
                    "武器系统与工程",
                    "武器发射工程",
                    "探测制导与控制技术",
                    "弹药工程与爆炸技术",
                    "特种能源技术与工程",
                    "装甲车辆工程",
                    "信息对抗技术"
                ]
            },
            {
                "key": "核工程类",
                "value": [
                    "核工程类",
                    "核工程与核技术",
                    "辐射防护与核安全",
                    "工程物理",
                    "核化工与核燃料工程"
                ]
            },
            {
                "key": "农业工程类",
                "value": [
                    "农业工程类",
                    "农业工程",
                    "农业机械化及其自动化",
                    "农业电气化",
                    "农业建筑环境与能源工程",
                    "农业水利工程"
                ]
            },
            {
                "key": "林业工程类",
                "value": [
                    "林业工程类",
                    "森林工程",
                    "木材科学与工程",
                    "林产化工"
                ]
            },
            {
                "key": "环境科学与工程类",
                "value": [
                    "环境科学与工程类",
                    "环境科学与工程",
                    "环境工程",
                    "环境科学",
                    "环境生态工程",
                    "环保设备工程",
                    "资源环境科学",
                    "水质科学与技术"
                ]
            },
            {
                "key": "生物医学工程类",
                "value": [
                    "生物医学工程类",
                    "生物医学工程",
                    "假肢矫形工程"
                ]
            },
            {
                "key": "食品科学与工程类",
                "value": [
                    "食品科学与工程类",
                    "食品科学与工程",
                    "食品质量与安全",
                    "粮食工程",
                    "乳品工程",
                    "酿酒工程",
                    "葡萄与葡萄酒工程",
                    "食品营养与检验教育",
                    "烹饪与营养教育"
                ]
            },
            {
                "key": "建筑类",
                "value": [
                    "建筑类",
                    "建筑学",
                    "城乡规划",
                    "风景园林",
                    "历史建筑保护工程"
                ]
            },
            {
                "key": "安全科学与工程类",
                "value": [
                    "安全科学与工程类",
                    "安全工程"
                ]
            },
            {
                "key": "生物工程类",
                "value": [
                    "生物工程类",
                    "生物工程",
                    "生物制药"
                ]
            },
            {
                "key": "公安技术类",
                "value": [
                    "公安技术类",
                    "刑事科学技术",
                    "消防工程",
                    "交通管理工程",
                    "安全防范工程",
                    "公安视听技术",
                    "抢险救援指挥与技术",
                    "火灾勘查",
                    "网络安全与执法",
                    "核生化消防"
                ]
            },
            {
                "key": "工科试验班类",
                "value": [
                    "工科试验班类"
                ]
            },
            {
                "key": "力学",
                "value": [
                    "力学",
                    "一般力学与力学基础",
                    "固体力学",
                    "流体力学",
                    "工程力学"
                ]
            },
            {
                "key": "机械工程",
                "value": [
                    "机械工程",
                    "机械制造及其自动化",
                    "机械电子工程",
                    "机械设计及理论",
                    "车辆工程"
                ]
            },
            {
                "key": "光学工程",
                "value": [
                    "光学工程"
                ]
            },
            {
                "key": "仪器科学与技术",
                "value": [
                    "仪器科学与技术",
                    "精密仪器及机械",
                    "测试计量技术及仪器"
                ]
            },
            {
                "key": "材料科学与工程",
                "value": [
                    "材料科学与工程",
                    "材料物理与化学",
                    "材料学",
                    "材料加工工程"
                ]
            },
            {
                "key": "冶金工程",
                "value": [
                    "冶金工程",
                    "冶金物理化学",
                    "钢铁冶金",
                    "有色金属冶金"
                ]
            },
            {
                "key": "动力工程及工程热物理",
                "value": [
                    "动力工程及工程热物理",
                    "工程热物理",
                    "热能工程",
                    "动力机械及工程",
                    "流体机械及工程",
                    "制冷及低温工程",
                    "化工过程机械"
                ]
            },
            {
                "key": "电气工程",
                "value": [
                    "电气工程",
                    "电机与电器",
                    "电力系统及其自动化",
                    "高电压与绝缘技术",
                    "电力电子与电力传动",
                    "电工理论与新技术"
                ]
            },
            {
                "key": "电子科学与技术",
                "value": [
                    "电子科学与技术",
                    "物理电子学",
                    "电路与系统",
                    "微电子学与固体电子学",
                    "电磁场与微波技术"
                ]
            },
            {
                "key": "信息与通信工程",
                "value": [
                    "信息与通信工程",
                    "通信与信息系统",
                    "信号与信息处理"
                ]
            },
            {
                "key": "控制科学与工程",
                "value": [
                    "控制科学与工程",
                    "控制理论与控制工程",
                    "检测技术与自动化装置",
                    "系统工程",
                    "模式识别与智能系统",
                    "导航、制导与控制"
                ]
            },
            {
                "key": "计算机科学与技术",
                "value": [
                    "计算机科学与技术",
                    "计算机系统结构",
                    "计算机软件与理论",
                    "计算机应用技术"
                ]
            },
            {
                "key": "建筑学",
                "value": [
                    "建筑历史与理论",
                    "建筑学",
                    "建筑设计及其理论",
                    "建筑技术科学"
                ]
            },
            {
                "key": "土木工程",
                "value": [
                    "土木工程",
                    "岩土工程",
                    "结构工程",
                    "市政工程",
                    "供热、供燃气、通风及空调工程",
                    "防灾减灾工程及防护工程",
                    "桥梁与隧道工程"
                ]
            },
            {
                "key": "水利工程",
                "value": [
                    "水利工程",
                    "水文学及水资源",
                    "水力学及河流动力学",
                    "水工结构工程",
                    "水利水电工程",
                    "港口、海岸及近海工程"
                ]
            },
            {
                "key": "测绘科学与技术",
                "value": [
                    "测绘科学与技术",
                    "大地测量学与测量工程",
                    "摄影测量与遥感",
                    "地图制图学与地理信息工程"
                ]
            },
            {
                "key": "化学工程与技术",
                "value": [
                    "化学工程与技术",
                    "化学工程",
                    "化学工艺",
                    "生物化工",
                    "应用化学",
                    "工业催化"
                ]
            },
            {
                "key": "地质资源与地质工程",
                "value": [
                    "地质资源与地质工程",
                    "矿产普查与勘探",
                    "地球探测与信息技术",
                    "地质工程"
                ]
            },
            {
                "key": "矿业工程",
                "value": [
                    "矿业工程",
                    "采矿工程",
                    "矿物加工工程",
                    "安全技术及工程"
                ]
            },
            {
                "key": "石油与天然气工程",
                "value": [
                    "石油与天然气工程",
                    "油气井工程",
                    "油气田开发工程",
                    "油气储运工程"
                ]
            },
            {
                "key": "纺织科学与工程",
                "value": [
                    "纺织科学与工程",
                    "纺织工程",
                    "纺织材料与纺织品设计",
                    "纺织化学与染整工程",
                    "服装设计与工程"
                ]
            },
            {
                "key": "轻工技术与工程",
                "value": [
                    "轻工技术与工程",
                    "制浆造纸工程",
                    "制糖工程",
                    "发酵工程",
                    "皮革化学与工程"
                ]
            },
            {
                "key": "交通运输工程",
                "value": [
                    "交通运输工程",
                    "道路与铁道工程",
                    "交通信息工程及控制",
                    "交通运输规划与管理",
                    "载运工具运用工程"
                ]
            },
            {
                "key": "船舶与海洋工程",
                "value": [
                    "船舶与海洋工程",
                    "船舶与海洋结构物设计制造",
                    "轮机工程",
                    "水声工程"
                ]
            },
            {
                "key": "航空宇航科学与技术",
                "value": [
                    "航空宇航科学与技术",
                    "飞行器设计",
                    "航空宇航推进理论与工程",
                    "航空宇航制造工程",
                    "人机与环境工程"
                ]
            },
            {
                "key": "兵器科学与技术",
                "value": [
                    "兵器科学与技术",
                    "武器系统与运用工程",
                    "兵器发射理论与技术",
                    "火炮、自动武器与弹药工程",
                    "军事化学与烟火技术"
                ]
            },
            {
                "key": "核科学与技术",
                "value": [
                    "核科学与技术",
                    "核能科学与工程",
                    "核燃料循环与材料",
                    "核技术及应用",
                    "辐射防护及环境保护"
                ]
            },
            {
                "key": "农业工程",
                "value": [
                    "农业工程",
                    "农业机械化工程",
                    "农业水土工程",
                    "农业生物环境与能源工程",
                    "农业电气化与自动化"
                ]
            },
            {
                "key": "林业工程",
                "value": [
                    "林业工程",
                    "森林工程",
                    "木材科学与技术",
                    "林产化学加工工程"
                ]
            },
            {
                "key": "环境科学与工程",
                "value": [
                    "环境科学与工程",
                    "环境科学",
                    "环境工程"
                ]
            },
            {
                "key": "生物医学工程",
                "value": [
                    "生物医学工程"
                ]
            },
            {
                "key": "食品科学与工程",
                "value": [
                    "食品科学与工程",
                    "食品科学",
                    "粮食、油脂及植物蛋白工程",
                    "农产品加工及贮藏工程",
                    "水产品加工及贮藏工程"
                ]
            },
            {
                "key": "城乡规划学",
                "value": [
                    "城乡规划学",
                    "城市规划与设计（含∶风景园林规划与设计）"
                ]
            },
            {
                "key": "风景园林学",
                "value": [
                    "风景园林学"
                ]
            },
            {
                "key": "软件工程",
                "value": [
                    "软件工程"
                ]
            },
            {
                "key": "生物工程",
                "value": [
                    "生物工程"
                ]
            },
            {
                "key": "安全科学与工程",
                "value": [
                    "安全科学与工程"
                ]
            },
            {
                "key": "公安技术",
                "value": [
                    "公安技术"
                ]
            },
            {
                "key": "科学技术史",
                "value": [
                    "科学技术史"
                ]
            },
            {
                "key": "管理科学与工程",
                "value": [
                    "管理科学与工程"
                ]
            },
            {
                "key": "设计学",
                "value": [
                    "设计学"
                ]
            },
            {
                "key": "工程",
                "value": [
                    "安全工程",
                    "兵器工程",
                    "核能与核技术工程",
                    "农业工程",
                    "林业工程",
                    "环境工程",
                    "生物医学工程",
                    "食品工程",
                    "航空工程",
                    "航天工程",
                    "车辆工程",
                    "制药工程",
                    "工业工程",
                    "工业设计工程",
                    "生物工程",
                    "项目管理",
                    "物流工程",
                    "电子与信息",
                    "先进制造",
                    "生物与医药",
                    "能源与环保",
                    "机械工程",
                    "光学工程",
                    "仪器仪表工程",
                    "材料工程",
                    "冶金工程",
                    "动力工程",
                    "电气工程",
                    "电子与通信工程",
                    "集成电路工程",
                    "控制工程",
                    "计算机技术",
                    "软件工程",
                    "建筑与土木工程",
                    "水利工程",
                    "测绘工程",
                    "化学工程",
                    "地质工程",
                    "矿业工程",
                    "石油与天然气工程",
                    "纺织工程",
                    "轻工技术与工程",
                    "交通运输工程",
                    "船舶与海洋工程"
                ]
            },
            {
                "key": "城市规划",
                "value": [
                    "城市规划"
                ]
            }
        ]
    },
    {
        "key": "农学",
        "value": [
            {
                "key": "植物生产类",
                "value": [
                    "植物生产类",
                    "农学",
                    "园艺",
                    "植物保护",
                    "植物科学与技术",
                    "种子科学与工程",
                    "设施农业科学与工程",
                    "茶学",
                    "烟草",
                    "应用生物科学",
                    "农艺教育",
                    "园艺教育"
                ]
            },
            {
                "key": "自然保护与环境生态类",
                "value": [
                    "自然保护与环境生态类",
                    "农业资源与环境",
                    "野生动物与自然保护区管理",
                    "水土保持与荒漠化防治"
                ]
            },
            {
                "key": "动物生产类",
                "value": [
                    "动物生产类",
                    "动物科学",
                    "蚕学",
                    "蜂学"
                ]
            },
            {
                "key": "动物医学类",
                "value": [
                    "动物医学类",
                    "动物医学",
                    "动物药学",
                    "动植物检疫"
                ]
            },
            {
                "key": "林学类",
                "value": [
                    "林学类",
                    "林学",
                    "园林",
                    "森林保护"
                ]
            },
            {
                "key": "水产类",
                "value": [
                    "水产类",
                    "水产养殖学",
                    "海洋渔业科学与技术",
                    "水族科学与技术"
                ]
            },
            {
                "key": "草学类",
                "value": [
                    "草学类",
                    "草业科学"
                ]
            },
            {
                "key": "作物学",
                "value": [
                    "作物学",
                    "作物栽培学与耕作学",
                    "作物遗传育种"
                ]
            },
            {
                "key": "园艺学",
                "value": [
                    "园艺学",
                    "果树学",
                    "蔬菜学",
                    "茶学"
                ]
            },
            {
                "key": "农业资源与环境",
                "value": [
                    "农业资源与环境",
                    "土壤学",
                    "植物营养学"
                ]
            },
            {
                "key": "植物保护",
                "value": [
                    "植物保护",
                    "植物病理学",
                    "农业昆虫与害虫防治",
                    "农药学"
                ]
            },
            {
                "key": "畜牧学",
                "value": [
                    "畜牧学",
                    "动物遗传育种与繁殖",
                    "动物营养与饲料科学",
                    "特种经济动物饲养"
                ]
            },
            {
                "key": "兽医学",
                "value": [
                    "兽医学",
                    "基础兽医学",
                    "预防兽医学",
                    "临床兽医学"
                ]
            },
            {
                "key": "林学",
                "value": [
                    "林学",
                    "林木遗传育种",
                    "森林培育",
                    "森林保护学",
                    "森林经理学",
                    "野生动植物保护与利用",
                    "园林植物与观赏园艺",
                    "水土保持与荒漠化防治"
                ]
            },
            {
                "key": "水产",
                "value": [
                    "水产",
                    "水产养殖",
                    "捕捞学",
                    "渔业资源"
                ]
            },
            {
                "key": "草学",
                "value": [
                    "草学"
                ]
            },
            {
                "key": "科学技术史",
                "value": [
                    "科学技术史"
                ]
            },
            {
                "key": "环境科学与工程",
                "value": [
                    "环境科学与工程",
                    "环境科学",
                    "环境工程"
                ]
            },
            {
                "key": "食品科学与工程",
                "value": [
                    "食品科学与工程",
                    "食品科学",
                    "粮食、油脂及植物蛋白工程",
                    "农产品加工及贮藏工程",
                    "水产品加工及贮藏工程"
                ]
            },
            {
                "key": "风景园林学",
                "value": [
                    "风景园林学"
                ]
            },
            {
                "key": "农业推广",
                "value": [
                    "农业",
                    "作物",
                    "园艺",
                    "农业资源利用",
                    "植物保护",
                    "养殖",
                    "草业",
                    "林业［设林业（0954）的单位不在此领域招生］",
                    "渔业",
                    "农业机械化",
                    "农村与区域发展",
                    "农业科技组织与服务",
                    "农业信息化",
                    "食品加工与安全",
                    "设施农业",
                    "种业"
                ]
            },
            {
                "key": "兽医",
                "value": [
                    "兽医"
                ]
            },
            {
                "key": "风景园林",
                "value": [
                    "风景园林"
                ]
            },
            {
                "key": "林业",
                "value": [
                    "林业"
                ]
            },
            {
                "key": "护理",
                "value": [
                    "护理"
                ]
            },
            {
                "key": "药学",
                "value": [
                    "药学"
                ]
            },
            {
                "key": "中药学",
                "value": [
                    "中药学"
                ]
            },
            {
                "key": "中医",
                "value": [
                    "中医内科学",
                    "中医外科学",
                    "中医骨伤科学",
                    "中医妇科学",
                    "中医儿科学",
                    "中医五官科学",
                    "针灸推拿学",
                    "民族医学（含：藏医学、蒙医学等）",
                    "中西医结合临床",
                    "中医",
                    "全科医学（中医，不授博士学位）"
                ]
            }
        ]
    },
    {
        "key": "医学",
        "value": [
            {
                "key": "基础医学类",
                "value": [
                    "基础医学类",
                    "基础医学"
                ]
            },
            {
                "key": "临床医学类",
                "value": [
                    "临床医学类",
                    "临床医学",
                    "麻醉学",
                    "医学影像学",
                    "眼视光医学",
                    "精神医学",
                    "放射医学"
                ]
            },
            {
                "key": "口腔医学类",
                "value": [
                    "口腔医学类",
                    "口腔医学"
                ]
            },
            {
                "key": "公共卫生与预防医学类",
                "value": [
                    "公共卫生与预防医学类",
                    "预防医学",
                    "食品卫生与营养学",
                    "妇幼保健医学",
                    "卫生监督",
                    "全球健康学"
                ]
            },
            {
                "key": "中医学类",
                "value": [
                    "中医学类",
                    "中医学",
                    "针灸推拿学",
                    "藏医学",
                    "蒙医学",
                    "维医学",
                    "壮医学",
                    "哈医学"
                ]
            },
            {
                "key": "中西医结合类",
                "value": [
                    "中西医结合类",
                    "中西医临床医学"
                ]
            },
            {
                "key": "药学类",
                "value": [
                    "药学类",
                    "药学",
                    "药物制剂",
                    "临床药学",
                    "药事管理",
                    "药物分析",
                    "药物化学",
                    "海洋药学"
                ]
            },
            {
                "key": "中药学类",
                "value": [
                    "中药学类",
                    "中药学",
                    "中药资源与开发",
                    "藏药学",
                    "蒙药学",
                    "中药制药",
                    "中草药栽培与鉴定"
                ]
            },
            {
                "key": "法医学类",
                "value": [
                    "法医学类",
                    "法医学"
                ]
            },
            {
                "key": "医学技术类",
                "value": [
                    "医学技术类",
                    "医学检验技术",
                    "医学实验技术",
                    "医学影像技术",
                    "眼视光学",
                    "康复治疗学",
                    "口腔医学技术",
                    "卫生检验与检疫",
                    "听力与言语康复学"
                ]
            },
            {
                "key": "医学试验班类",
                "value": [
                    "医学试验班类"
                ]
            },
            {
                "key": "基础医学",
                "value": [
                    "基础医学",
                    "人体解剖与组织胚胎学",
                    "免疫学",
                    "病原生物学",
                    "病理学与病理生理学",
                    "法医学",
                    "放射医学"
                ]
            },
            {
                "key": "临床医学",
                "value": [
                    "临床医学",
                    "内科学",
                    "儿科学",
                    "老年医学",
                    "神经病学",
                    "精神病与精神卫生学",
                    "皮肤病与性病学",
                    "影像医学与核医学",
                    "临床检验诊断学",
                    "外科学",
                    "妇产科学",
                    "眼科学",
                    "耳鼻咽喉科学",
                    "肿瘤学",
                    "康复医学与理疗学",
                    "运动医学",
                    "麻醉学",
                    "急诊医学",
                    "全科医学（不授博士学位）",
                    "临床病理学（不授博士学位）"
                ]
            },
            {
                "key": "口腔医学",
                "value": [
                    "口腔医学",
                    "口腔基础医学",
                    "口腔临床医学"
                ]
            },
            {
                "key": "公共卫生与预防医学",
                "value": [
                    "公共卫生与预防医学",
                    "流行病与卫生统计学",
                    "劳动卫生与环境卫生学",
                    "营养与食品卫生学",
                    "儿少卫生与妇幼保健学",
                    "卫生毒理学",
                    "军事预防医学"
                ]
            },
            {
                "key": "中医学",
                "value": [
                    "中医学",
                    "中医基础理论",
                    "中医临床基础",
                    "中医医史文献",
                    "方剂学",
                    "中医诊断学",
                    "中医内科学",
                    "中医外科学",
                    "中医骨伤科学",
                    "中医妇科学",
                    "中医儿科学",
                    "中医五官科学",
                    "针灸推拿学",
                    "民族医学（含：藏医学、蒙医学等）"
                ]
            },
            {
                "key": "中西医结合",
                "value": [
                    "中西医结合",
                    "中西医结合基础",
                    "中西医结合临床"
                ]
            },
            {
                "key": "药学",
                "value": [
                    "药学",
                    "药物化学",
                    "药剂学",
                    "生药学",
                    "药物分析学",
                    "微生物与生化药学",
                    "药理学"
                ]
            },
            {
                "key": "中药学",
                "value": [
                    "中药学"
                ]
            },
            {
                "key": "特种医学",
                "value": [
                    "特种医学",
                    "航空、航天与航海医学"
                ]
            },
            {
                "key": "医学技术",
                "value": [
                    "医学技术"
                ]
            },
            {
                "key": "护理学",
                "value": [
                    "护理学"
                ]
            },
            {
                "key": "科学技术史",
                "value": [
                    "科学技术史"
                ]
            },
            {
                "key": "生物医学工程",
                "value": [
                    "生物医学工程"
                ]
            },
            {
                "key": "公共卫生",
                "value": [
                    "公共卫生"
                ]
            }
        ]
    },
    {
        "key": "管理学",
        "value": [
            {
                "key": "管理科学与工程类",
                "value": [
                    "管理科学与工程类",
                    "管理科学",
                    "信息管理与信息系统",
                    "工程管理",
                    "房地产开发与管理",
                    "工程造价",
                    "保密管理"
                ]
            },
            {
                "key": "工商管理类",
                "value": [
                    "工商管理类",
                    "工商管理",
                    "市场营销",
                    "会计学",
                    "财务管理",
                    "国际商务",
                    "人力资源管理",
                    "审计学",
                    "资产评估",
                    "物业管理",
                    "文化产业管理",
                    "劳动关系",
                    "体育经济与管理",
                    "财务会计教育",
                    "市场营销教育"
                ]
            },
            {
                "key": "农业经济管理类",
                "value": [
                    "农业经济管理类",
                    "农林经济管理",
                    "农村区域发展"
                ]
            },
            {
                "key": "公共管理类",
                "value": [
                    "公共管理类",
                    "公共事业管理",
                    "行政管理",
                    "劳动与社会保障",
                    "土地资源管理",
                    "城市管理",
                    "海关管理",
                    "交通管理",
                    "海事管理",
                    "公共关系学"
                ]
            },
            {
                "key": "图书情报与档案管理类",
                "value": [
                    "图书情报与档案管理类",
                    "图书馆学",
                    "档案学",
                    "信息资源管理"
                ]
            },
            {
                "key": "物流管理与工程类",
                "value": [
                    "物流管理与工程类",
                    "物流管理",
                    "物流工程",
                    "采购管理"
                ]
            },
            {
                "key": "工业工程类",
                "value": [
                    "工业工程类",
                    "工业工程",
                    "标准化工程",
                    "质量管理工程"
                ]
            },
            {
                "key": "电子商务类",
                "value": [
                    "电子商务类",
                    "电子商务",
                    "电子商务及法律"
                ]
            },
            {
                "key": "旅游管理类",
                "value": [
                    "旅游管理类",
                    "旅游管理",
                    "酒店管理",
                    "会展经济与管理",
                    "旅游管理与服务教育"
                ]
            },
            {
                "key": "管理科学与工程",
                "value": [
                    "管理科学与工程"
                ]
            },
            {
                "key": "工商管理",
                "value": [
                    "工商管理",
                    "会计学",
                    "企业管理",
                    "旅游管理",
                    "技术经济及管理"
                ]
            },
            {
                "key": "农林经济管理",
                "value": [
                    "农林经济管理",
                    "农业经济管理",
                    "林业经济管理"
                ]
            },
            {
                "key": "公共管理",
                "value": [
                    "公共管理",
                    "行政管理",
                    "社会医学与卫生事业管理",
                    "教育经济与管理",
                    "社会保障",
                    "土地资源管理"
                ]
            },
            {
                "key": "图书情报与档案管理",
                "value": [
                    "图书情报与档案管理",
                    "图书馆学",
                    "情报学",
                    "档案学"
                ]
            },
            {
                "key": "会计",
                "value": [
                    "会计"
                ]
            },
            {
                "key": "旅游管理",
                "value": [
                    "旅游管理"
                ]
            },
            {
                "key": "图书情报",
                "value": [
                    "图书情报"
                ]
            },
            {
                "key": "工程管理",
                "value": [
                    "工程管理"
                ]
            }
        ]
    },
    {
        "key": "艺术学",
        "value": [
            {
                "key": "艺术学理论类",
                "value": [
                    "艺术学理论类",
                    "艺术史论"
                ]
            },
            {
                "key": "音乐与舞蹈学类",
                "value": [
                    "音乐与舞蹈学类",
                    "音乐表演",
                    "音乐学",
                    "作曲与作曲技术理论",
                    "舞蹈表演",
                    "舞蹈学"
                ]
            },
            {
                "key": "戏剧与影视学类",
                "value": [
                    "戏剧与影视学类",
                    "表演",
                    "戏剧学",
                    "电影学",
                    "戏剧影视文学",
                    "广播电视编导",
                    "戏剧影视导演",
                    "戏剧影视美术设计",
                    "录音艺术",
                    "播音与主持艺术",
                    "动画",
                    "影视摄影与制作"
                ]
            },
            {
                "key": "美术学类",
                "value": [
                    "美术学类",
                    "美术学",
                    "绘画",
                    "雕塑",
                    "摄影",
                    "书法学",
                    "中国画"
                ]
            },
            {
                "key": "设计学类",
                "value": [
                    "设计学类",
                    "艺术设计学",
                    "视觉传达设计",
                    "环境设计",
                    "产品设计",
                    "服装与服饰设计",
                    "公共艺术",
                    "工艺美术",
                    "数字媒体艺术",
                    "艺术与科技"
                ]
            },
            {
                "key": "艺术学理论",
                "value": [
                    "艺术学理论",
                    "艺术学"
                ]
            },
            {
                "key": "音乐与舞蹈学",
                "value": [
                    "音乐与舞蹈学",
                    "音乐学"
                ]
            },
            {
                "key": "戏剧与影视学",
                "value": [
                    "电影学",
                    "戏剧与影视学",
                    "戏剧戏曲学",
                    "广播电视艺术学"
                ]
            },
            {
                "key": "美术学",
                "value": [
                    "美术学"
                ]
            },
            {
                "key": "设计学",
                "value": [
                    "设计学",
                    "设计艺术学"
                ]
            },
            {
                "key": "艺术",
                "value": [
                    "艺术",
                    "音乐",
                    "戏剧",
                    "戏曲",
                    "电影",
                    "广播电视",
                    "舞蹈",
                    "美术",
                    "艺术设计"
                ]
            }
        ]
    },
    {
        "key": "农林牧渔",
        "value": [
            {
                "key": "农业类",
                "value": [
                    "农业类",
                    "作物生产技术",
                    "种子生产与经营",
                    "设施农业与装备",
                    "现代农业技术",
                    "休闲农业",
                    "生态农业技术",
                    "园艺技术",
                    "植物保护与检疫技术",
                    "茶树栽培与茶叶加工",
                    "中草药栽培技术",
                    "烟草栽培与加工",
                    "棉花加工与经营管理",
                    "农产品加工与质量检测",
                    "绿色食品生产与检验",
                    "农资营销与服务",
                    "农产品流通与管理",
                    "农业装备应用技术",
                    "农业经济管理",
                    "农村经营管理"
                ]
            },
            {
                "key": "林业类",
                "value": [
                    "林业类",
                    "林业技术",
                    "园林技术",
                    "森林资源保护",
                    "经济林培育与利用",
                    "野生植物资源保护与利用",
                    "野生动物资源保护与利用",
                    "森林生态旅游",
                    "森林防火指挥与通讯",
                    "自然保护区建设与管理",
                    "木工设备应用技术",
                    "木材加工技术",
                    "林业调查与信息处理",
                    "林业信息技术与管理"
                ]
            },
            {
                "key": "畜牧业类",
                "value": [
                    "畜牧业类",
                    "畜牧兽医",
                    "动物医学",
                    "动物药学",
                    "动物防疫与检疫",
                    "动物医学检验技术",
                    "宠物养护与驯导",
                    "实验动物技术",
                    "饲料与动物营养",
                    "特种动物养殖",
                    "畜牧工程技术",
                    "蚕桑技术",
                    "草业技术",
                    "养蜂与蜂产品加工",
                    "畜牧业经济管理"
                ]
            },
            {
                "key": "渔业类",
                "value": [
                    "渔业类",
                    "水产养殖技术",
                    "海洋渔业技术",
                    "水族科学与技术",
                    "水生动物医学",
                    "渔业经济管理"
                ]
            }
        ]
    },
    {
        "key": "资源环境与安全",
        "value": [
            {
                "key": "资源勘查类",
                "value": [
                    "资源勘查类",
                    "国土资源调查与管理",
                    "地质调查与矿产普查",
                    "矿产地质与勘查",
                    "岩矿分析与鉴定",
                    "宝玉石鉴定与加工",
                    "煤田地质与勘查技术"
                ]
            },
            {
                "key": "地质类",
                "value": [
                    "地质类",
                    "工程地质勘查",
                    "水文与工程地质",
                    "钻探技术",
                    "矿山地质",
                    "地球物理勘探技术",
                    "地质灾害调查与防治",
                    "环境地质工程",
                    "岩土工程技术"
                ]
            },
            {
                "key": "测绘地理信息类",
                "value": [
                    "测绘地理信息类",
                    "工程测量技术",
                    "摄影测量与遥感技术",
                    "测绘工程技术",
                    "测绘地理信息技术",
                    "地籍测绘与土地管理",
                    "矿山测量",
                    "测绘与地质工程技术",
                    "导航与位置服务",
                    "地图制图与数字传播技术",
                    "地理国情监测技术",
                    "国土测绘与规划"
                ]
            },
            {
                "key": "石油与天然气类",
                "value": [
                    "石油与天然气类",
                    "钻井技术",
                    "油气开采技术",
                    "油气储运技术",
                    "油气地质勘探技术",
                    "油田化学应用技术",
                    "石油工程技术"
                ]
            },
            {
                "key": "煤炭类",
                "value": [
                    "煤炭类",
                    "煤矿开采技术",
                    "矿井建设",
                    "矿山机电技术",
                    "矿井通风与安全",
                    "综合机械化采煤",
                    "选煤技术",
                    "煤炭深加工与利用",
                    "煤化分析与检验",
                    "煤层气采输技术",
                    "矿井运输与提升"
                ]
            },
            {
                "key": "金属与非金属矿类",
                "value": [
                    "金属与非金属矿类",
                    "金属与非金属矿开采技术",
                    "矿物加工技术",
                    "矿业装备维护技术"
                ]
            },
            {
                "key": "气象类",
                "value": [
                    "气象类",
                    "大气科学技术",
                    "大气探测技术",
                    "应用气象技术",
                    "防雷技术"
                ]
            },
            {
                "key": "环境保护类",
                "value": [
                    "环境保护类",
                    "环境监测与控制技术",
                    "农村环境保护",
                    "室内环境检测与控制技术",
                    "环境工程技术",
                    "环境信息技术",
                    "核与辐射检测防护技术",
                    "环境规划与管理",
                    "环境评价与咨询服务",
                    "污染修复与生态工程技术",
                    "清洁生产与减排技术",
                    "资源综合利用与管理技术"
                ]
            },
            {
                "key": "安全类",
                "value": [
                    "安全类",
                    "安全健康与环保",
                    "化工安全技术",
                    "救援技术",
                    "安全技术与管理",
                    "工程安全评价与监理",
                    "安全生产监测监控",
                    "职业卫生技术与管理"
                ]
            }
        ]
    },
    {
        "key": "能源动力与材料",
        "value": [
            {
                "key": "电力技术类",
                "value": [
                    "电力技术类",
                    "发电厂及电力系统",
                    "供用电技术",
                    "电力系统自动化技术",
                    "高压输配电线路施工运行与维护",
                    "电力系统继电保护与自动化技术",
                    "水电站机电设备与自动化",
                    "电网监控技术",
                    "电力客户服务与管理",
                    "水电站与电力网",
                    "电源变换技术与应用",
                    "农业电气化技术",
                    "分布式发电与微电网技术"
                ]
            },
            {
                "key": "热能与发电工程类",
                "value": [
                    "热能与发电工程类",
                    "电厂热能动力装置",
                    "城市热能应用技术",
                    "核电站动力设备运行与维护",
                    "火电厂集控运行",
                    "电厂化学与环保技术",
                    "电厂热工自动化技术"
                ]
            },
            {
                "key": "新能源发电工程类",
                "value": [
                    "新能源发电工程类",
                    "风力发电工程技术",
                    "风电系统运行与维护",
                    "生物质能应用技术",
                    "光伏发电技术与应用",
                    "工业节能技术",
                    "节电技术与管理",
                    "太阳能光热技术与应用",
                    "农村能源与环境技术"
                ]
            },
            {
                "key": "黑色金属材料类",
                "value": [
                    "黑色金属材料类",
                    "黑色冶金技术",
                    "轧钢工程技术",
                    "钢铁冶金设备应用技术",
                    "金属材料质量检测",
                    "铁矿资源综合利用"
                ]
            },
            {
                "key": "有色金属材料类",
                "value": [
                    "有色金属材料类",
                    "有色冶金技术",
                    "有色冶金设备应用技术",
                    "金属压力加工",
                    "金属精密成型技术"
                ]
            },
            {
                "key": "非金属材料类",
                "value": [
                    "非金属材料类",
                    "材料工程技术",
                    "高分子材料工程技术",
                    "复合材料工程技术",
                    "非金属矿物材料技术",
                    "光伏材料制备技术",
                    "炭素加工技术",
                    "硅材料制备技术",
                    "橡胶工程技术"
                ]
            },
            {
                "key": "建筑材料类",
                "value": [
                    "建筑材料类",
                    "建筑材料工程技术",
                    "建筑材料检测技术",
                    "建筑装饰材料技术",
                    "建筑材料设备应用",
                    "新型建筑材料技术",
                    "建筑材料生产与管理"
                ]
            }
        ]
    },
    {
        "key": "土木建筑",
        "value": [
            {
                "key": "建筑设计类",
                "value": [
                    "建筑设计类",
                    "建筑设计",
                    "建筑装饰工程技术",
                    "古建筑工程技术",
                    "建筑室内设计",
                    "风景园林设计",
                    "园林工程技术",
                    "建筑动画与模型制作"
                ]
            },
            {
                "key": "城乡规划与管理类",
                "value": [
                    "城乡规划与管理类",
                    "城乡规划",
                    "村镇建设与管理",
                    "城市信息化管理"
                ]
            },
            {
                "key": "土建施工类",
                "value": [
                    "土建施工类",
                    "建筑工程技术",
                    "地下与隧道工程技术",
                    "土木工程检测技术",
                    "建筑钢结构工程技术"
                ]
            },
            {
                "key": "建筑设备类",
                "value": [
                    "建筑设备类",
                    "建筑设备工程技术",
                    "供热通风与空调工程技术",
                    "建筑电气工程技术",
                    "建筑智能化工程技术",
                    "工业设备安装工程技术",
                    "消防工程技术"
                ]
            },
            {
                "key": "建设工程管理类",
                "value": [
                    "建设工程管理类",
                    "建设工程管理",
                    "工程造价",
                    "建筑经济管理",
                    "建设项目信息化管理",
                    "建设工程监理"
                ]
            },
            {
                "key": "市政工程类",
                "value": [
                    "市政工程类",
                    "市政工程技术",
                    "城市燃气工程技术",
                    "给排水工程技术",
                    "环境卫生工程技术"
                ]
            },
            {
                "key": "房地产类",
                "value": [
                    "房地产类",
                    "房地产经营与管理",
                    "房地产检测与估价",
                    "物业管理"
                ]
            }
        ]
    },
    {
        "key": "水利",
        "value": [
            {
                "key": "水文水资源类",
                "value": [
                    "水文水资源类",
                    "水文与水资源工程",
                    "水文测报技术",
                    "水政水资源管理"
                ]
            },
            {
                "key": "水利工程与管理类",
                "value": [
                    "水利工程与管理类",
                    "水利工程",
                    "水利水电工程技术",
                    "水利水电工程管理",
                    "水利水电建筑工程",
                    "机电排灌工程技术",
                    "港口航道与治河工程",
                    "水务管理"
                ]
            },
            {
                "key": "水利水电设备类",
                "value": [
                    "水利水电设备类",
                    "水电站动力设备",
                    "水电站电气设备",
                    "水电站运行与管理",
                    "水利机电设备运行与管理"
                ]
            },
            {
                "key": "水土保持与水环境类",
                "value": [
                    "水土保持与水环境类",
                    "水土保持技术",
                    "水环境监测与治理"
                ]
            }
        ]
    },
    {
        "key": "装备制造",
        "value": [
            {
                "key": "机械设计制造类",
                "value": [
                    "机械设计制造类",
                    "机械设计与制造",
                    "机械制造与自动化",
                    "数控技术",
                    "精密机械技术",
                    "特种加工技术",
                    "材料成型与控制技术",
                    "金属材料与热处理技术",
                    "铸造技术",
                    "锻压技术",
                    "焊接技术与自动化",
                    "机械产品检测检验技术",
                    "理化测试与质检技术",
                    "模具设计与制造",
                    "电机与电器技术",
                    "电线电缆制造技术",
                    "内燃机制造与维修",
                    "机械装备制造技术",
                    "工业设计",
                    "工业工程技术"
                ]
            },
            {
                "key": "机电设备类",
                "value": [
                    "机电设备类",
                    "自动化生产设备应用",
                    "机电设备安装技术",
                    "机电设备维修与管理",
                    "数控设备应用与维护",
                    "制冷与空调技术",
                    "光电制造与应用技术",
                    "新能源装备技术"
                ]
            },
            {
                "key": "自动化类",
                "value": [
                    "自动化类",
                    "机电一体化技术",
                    "电气自动化技术",
                    "工业过程自动化技术",
                    "智能控制技术",
                    "工业网络技术",
                    "工业自动化仪表",
                    "液压与气动技术",
                    "电梯工程技术",
                    "工业机器人技术"
                ]
            },
            {
                "key": "铁道装备类",
                "value": [
                    "铁道装备类",
                    "铁道机车车辆制造与维护",
                    "铁道通信信号设备制造与维护",
                    "铁道施工和养路机械制造与维护"
                ]
            },
            {
                "key": "船舶与海洋工程装备类",
                "value": [
                    "船舶与海洋工程装备类",
                    "船舶工程技术",
                    "船舶机械工程技术",
                    "船舶电气工程技术",
                    "船舶舾装工程技术",
                    "船舶涂装工程技术",
                    "游艇设计与制造",
                    "海洋工程技术",
                    "船舶通信与导航",
                    "船舶动力工程技术"
                ]
            },
            {
                "key": "航空装备类",
                "value": [
                    "航空装备类",
                    "飞行器制造技术",
                    "飞行器维修技术",
                    "航空发动机制造技术",
                    "航空发动机装试技术",
                    "航空发动机维修技术",
                    "飞机机载设备制造技术",
                    "飞机机载设备维修技术",
                    "航空电子电气技术",
                    "航空材料精密成型技术",
                    "无人机应用技术",
                    "导弹维修"
                ]
            },
            {
                "key": "汽车制造类",
                "value": [
                    "汽车制造类",
                    "汽车制造与装配技术",
                    "汽车检测与维修技术",
                    "汽车电子技术",
                    "汽车造型技术",
                    "汽车试验技术",
                    "汽车改装技术",
                    "新能源汽车技术"
                ]
            }
        ]
    },
    {
        "key": "生物与化工",
        "value": [
            {
                "key": "生物技术类",
                "value": [
                    "生物技术类",
                    "食品生物技术",
                    "化工生物技术",
                    "药品生物技术",
                    "农业生物技术",
                    "生物产品检验检疫"
                ]
            },
            {
                "key": "化工技术类",
                "value": [
                    "化工技术类",
                    "应用化工技术",
                    "石油炼制技术",
                    "石油化工技术",
                    "高分子合成技术",
                    "精细化工技术",
                    "海洋化工技术",
                    "工业分析技术",
                    "化工装备技术",
                    "化工自动化技术",
                    "涂装防护技术",
                    "烟花爆竹技术与管理",
                    "煤化工技术"
                ]
            }
        ]
    },
    {
        "key": "轻工纺织",
        "value": [
            {
                "key": "轻化工类",
                "value": [
                    "轻化工类",
                    "高分子材料加工技术",
                    "制浆造纸技术",
                    "香料香精工艺",
                    "表面精饰工艺",
                    "家具设计与制造",
                    "化妆品技术",
                    "皮革加工技术",
                    "皮具制作与工艺",
                    "鞋类设计与工艺",
                    "乐器制造与维护",
                    "陶瓷制造工艺"
                ]
            },
            {
                "key": "包装类",
                "value": [
                    "包装类",
                    "包装工程技术",
                    "包装策划与设计",
                    "包装设备应用技术",
                    "食品包装技术"
                ]
            },
            {
                "key": "印刷类",
                "value": [
                    "印刷类",
                    "数字图文信息技术",
                    "印刷设备应用技术",
                    "印刷媒体设计与制作",
                    "印刷媒体技术",
                    "数字印刷技术"
                ]
            },
            {
                "key": "纺织服装类",
                "value": [
                    "纺织服装类",
                    "现代纺织技术",
                    "丝绸技术",
                    "染整技术",
                    "纺织机电技术",
                    "纺织品检验与贸易",
                    "纺织品设计",
                    "家用纺织品设计",
                    "纺织材料与应用",
                    "针织技术与针织服装",
                    "服装设计与工艺",
                    "皮革服装制作与工艺",
                    "服装陈列与展示设计"
                ]
            }
        ]
    },
    {
        "key": "食品药品与粮食",
        "value": [
            {
                "key": "食品工业类",
                "value": [
                    "食品工业类",
                    "食品加工技术",
                    "酿酒技术",
                    "食品质量与安全",
                    "食品贮运与营销",
                    "食品检测技术",
                    "食品营养与卫生",
                    "食品营养与检测"
                ]
            },
            {
                "key": "药品制造类",
                "value": [
                    "药品制造类",
                    "中药生产与加工",
                    "药品生产技术",
                    "兽药制药技术",
                    "药品质量与安全",
                    "制药设备应用技术"
                ]
            },
            {
                "key": "食品药品管理类",
                "value": [
                    "食品药品管理类",
                    "药品经营与管理",
                    "药品服务与管理",
                    "保健品开发与管理",
                    "化妆品经营与管理"
                ]
            },
            {
                "key": "粮食工业类",
                "value": [
                    "粮食工业类",
                    "粮食工程技术"
                ]
            },
            {
                "key": "粮食储检类",
                "value": [
                    "粮食储检类",
                    "粮油储藏与检测技术"
                ]
            }
        ]
    },
    {
        "key": "交通运输",
        "value": [
            {
                "key": "铁道运输类",
                "value": [
                    "铁道运输类",
                    "铁道机车",
                    "铁道车辆",
                    "铁道供电技术",
                    "铁道工程技术",
                    "铁道机械化维修技术",
                    "铁道信号自动控制",
                    "铁道通信与信息化技术",
                    "铁道交通运营管理",
                    "铁路物流管理",
                    "铁路桥梁与隧道工程技术",
                    "高速铁道工程技术",
                    "高速铁路客运乘务",
                    "动车组检修技术"
                ]
            },
            {
                "key": "道路运输类",
                "value": [
                    "道路运输类",
                    "智能交通技术运用",
                    "道路桥梁工程技术",
                    "道路运输与路政管理",
                    "道路养护与管理",
                    "公路机械化施工技术",
                    "工程机械运用技术",
                    "交通运营管理",
                    "交通枢纽运营管理",
                    "汽车运用与维修技术",
                    "汽车车身维修技术",
                    "汽车运用安全管理",
                    "新能源汽车运用与维修"
                ]
            },
            {
                "key": "水上运输类",
                "value": [
                    "水上运输类",
                    "航海技术",
                    "国际邮轮乘务管理",
                    "船舶电子电气技术",
                    "船舶检验",
                    "港口机械与自动控制",
                    "港口电气技术",
                    "港口与航道工程技术",
                    "港口与航运管理",
                    "港口物流管理",
                    "轮机工程技术",
                    "海上救捞技术",
                    "水路运输与海事管理",
                    "集装箱运输管理"
                ]
            },
            {
                "key": "航空运输类",
                "value": [
                    "航空运输类",
                    "民航运输",
                    "民航通信技术",
                    "定翼机驾驶技术",
                    "直升机驾驶技术",
                    "空中乘务",
                    "民航安全技术管理",
                    "民航空中安全保卫",
                    "机场运行",
                    "飞机机电设备维修",
                    "飞机电子设备维修",
                    "飞机部件修理",
                    "航空地面设备维修",
                    "机场场务技术与管理",
                    "航空油料",
                    "航空物流",
                    "通用航空器维修",
                    "通用航空航务技术",
                    "飞机结构修理"
                ]
            },
            {
                "key": "管道运输类",
                "value": [
                    "管道运输类",
                    "管道工程技术",
                    "管道运输管理"
                ]
            },
            {
                "key": "城市轨道交通类",
                "value": [
                    "城市轨道交通类",
                    "城市轨道交通车辆技术",
                    "城市轨道交通机电技术",
                    "城市轨道交通通信信号技术",
                    "城市轨道交通供配电技术",
                    "城市轨道交通工程技术",
                    "城市轨道交通运营管理"
                ]
            },
            {
                "key": "邮政类",
                "value": [
                    "邮政类",
                    "邮政通信管理",
                    "快递运营管理"
                ]
            }
        ]
    },
    {
        "key": "电子信息",
        "value": [
            {
                "key": "电子信息类",
                "value": [
                    "电子信息类",
                    "电子信息工程技术",
                    "应用电子技术",
                    "微电子技术",
                    "智能产品开发",
                    "智能终端技术与应用",
                    "智能监控技术应用",
                    "汽车智能技术",
                    "电子产品质量检测",
                    "电子产品营销与服务",
                    "电子电路设计与工艺",
                    "电子制造技术与设备",
                    "电子测量技术与仪器",
                    "电子工艺与管理",
                    "声像工程技术",
                    "移动互联应用技术",
                    "光电技术应用",
                    "光伏工程技术",
                    "光电显示技术",
                    "物联网应用技术"
                ]
            },
            {
                "key": "计算机类",
                "value": [
                    "计算机类",
                    "计算机应用技术",
                    "计算机网络技术",
                    "计算机信息管理",
                    "计算机系统与维护",
                    "软件技术",
                    "软件与信息服务",
                    "动漫制作技术",
                    "嵌入式技术与应用",
                    "数字展示技术",
                    "数字媒体应用技术",
                    "信息安全与管理",
                    "移动应用开发",
                    "云计算技术与应用",
                    "电子商务技术"
                ]
            },
            {
                "key": "通信类",
                "value": [
                    "通信类",
                    "通信技术",
                    "移动通信技术",
                    "通信系统运行管理",
                    "通信工程设计与监理",
                    "电信服务与管理",
                    "光通信技术",
                    "物联网工程技术"
                ]
            }
        ]
    },
    {
        "key": "医药卫生",
        "value": [
            {
                "key": "临床医学类",
                "value": [
                    "临床医学类",
                    "临床医学",
                    "口腔医学",
                    "中医学",
                    "中医骨伤",
                    "针灸推拿",
                    "蒙医学",
                    "藏医学",
                    "维医学",
                    "傣医学",
                    "哈医学"
                ]
            },
            {
                "key": "护理类",
                "value": [
                    "护理类",
                    "护理",
                    "助产"
                ]
            },
            {
                "key": "药学类",
                "value": [
                    "药学类",
                    "药学",
                    "中药学",
                    "蒙药学",
                    "维药学",
                    "藏药学"
                ]
            },
            {
                "key": "医学技术类",
                "value": [
                    "医学技术类",
                    "医学检验技术",
                    "医学生物技术",
                    "医学影像技术",
                    "医学美容技术",
                    "口腔医学技术",
                    "卫生检验与检疫技术",
                    "眼视光技术",
                    "放射治疗技术",
                    "呼吸治疗技术"
                ]
            },
            {
                "key": "康复治疗类",
                "value": [
                    "康复治疗类",
                    "康复治疗技术",
                    "言语听觉康复技术",
                    "中医康复技术"
                ]
            },
            {
                "key": "公共卫生与卫生管理类",
                "value": [
                    "公共卫生与卫生管理类",
                    "预防医学",
                    "公共卫生管理",
                    "卫生监督",
                    "卫生信息管理"
                ]
            },
            {
                "key": "人口与计划生育类",
                "value": [
                    "人口与计划生育类",
                    "人口与家庭发展服务",
                    "生殖健康服务与管理"
                ]
            },
            {
                "key": "健康管理与促进类",
                "value": [
                    "健康管理与促进类",
                    "健康管理",
                    "医学营养",
                    "中医养生保健",
                    "心理咨询",
                    "医疗设备应用技术",
                    "精密医疗器械技术",
                    "医疗器械维护与管理",
                    "康复工程技术",
                    "康复辅助器具技术",
                    "假肢与矫形器技术",
                    "老年保健与管理"
                ]
            }
        ]
    },
    {
        "key": "财经商贸",
        "value": [
            {
                "key": "财政税务类",
                "value": [
                    "财政税务类",
                    "财政",
                    "税务",
                    "资产评估与管理",
                    "政府采购管理"
                ]
            },
            {
                "key": "金融类",
                "value": [
                    "金融类",
                    "金融管理",
                    "国际金融",
                    "证券与期货",
                    "信托与租赁",
                    "保险",
                    "投资与理财",
                    "信用管理",
                    "农村金融",
                    "互联网金融"
                ]
            },
            {
                "key": "财务会计类",
                "value": [
                    "财务会计类",
                    "财务管理",
                    "会计",
                    "审计",
                    "会计信息管理"
                ]
            },
            {
                "key": "统计类",
                "value": [
                    "统计类",
                    "信息统计与分析",
                    "统计与会计核算"
                ]
            },
            {
                "key": "经济贸易类",
                "value": [
                    "经济贸易类",
                    "国际贸易实务",
                    "国际经济与贸易",
                    "国际商务",
                    "服务外包",
                    "经济信息管理",
                    "报关与国际货运",
                    "商务经纪与代理",
                    "国际文化贸易"
                ]
            },
            {
                "key": "工商管理类",
                "value": [
                    "工商管理类",
                    "工商企业管理",
                    "商务管理",
                    "商检技术",
                    "连锁经营管理",
                    "市场管理与服务",
                    "品牌代理经营"
                ]
            },
            {
                "key": "市场营销类",
                "value": [
                    "市场营销类",
                    "市场营销",
                    "汽车营销与服务",
                    "广告策划与营销",
                    "茶艺与茶叶营销"
                ]
            },
            {
                "key": "电子商务类",
                "value": [
                    "电子商务类",
                    "电子商务",
                    "移动商务",
                    "网络营销"
                ]
            },
            {
                "key": "物流类",
                "value": [
                    "物流类",
                    "物流工程技术",
                    "物流信息技术",
                    "物流管理",
                    "物流金融管理",
                    "工程物流管理",
                    "冷链物流技术与管理",
                    "采购供应管理"
                ]
            }
        ]
    },
    {
        "key": "旅游",
        "value": [
            {
                "key": "旅游类",
                "value": [
                    "旅游类",
                    "旅游管理",
                    "导游",
                    "旅行社经营管理",
                    "景区开发与管理",
                    "酒店管理",
                    "休闲服务与管理"
                ]
            },
            {
                "key": "餐饮类",
                "value": [
                    "餐饮类",
                    "餐饮管理",
                    "烹调工艺与营养",
                    "营养配餐",
                    "中西面点工艺",
                    "西餐工艺"
                ]
            },
            {
                "key": "会展类",
                "value": [
                    "会展类",
                    "会展策划与管理"
                ]
            }
        ]
    },
    {
        "key": "文化艺术",
        "value": [
            {
                "key": "艺术设计类",
                "value": [
                    "艺术设计类",
                    "艺术设计",
                    "视觉传播设计与制作",
                    "广告设计与制作",
                    "数字媒体艺术设计",
                    "产品艺术设计",
                    "家具艺术设计",
                    "皮具艺术设计",
                    "服装与服饰设计",
                    "室内艺术设计",
                    "展示艺术设计",
                    "环境艺术设计",
                    "公共艺术设计",
                    "雕刻艺术设计",
                    "包装艺术设计",
                    "陶瓷设计与工艺",
                    "刺绣设计与工艺",
                    "玉器设计与工艺",
                    "首饰设计与工艺",
                    "工艺美术品设计",
                    "动漫设计",
                    "游戏设计",
                    "人物形象设计",
                    "美容美体艺术",
                    "摄影与摄像艺术",
                    "美术"
                ]
            },
            {
                "key": "表演艺术类",
                "value": [
                    "表演艺术类",
                    "表演艺术",
                    "戏剧影视表演",
                    "歌舞表演",
                    "戏曲表演",
                    "曲艺表演",
                    "音乐剧表演",
                    "舞蹈表演",
                    "国际标准舞",
                    "服装表演",
                    "模特与礼仪",
                    "现代流行音乐",
                    "作曲技术",
                    "音乐制作",
                    "钢琴伴奏",
                    "钢琴调律",
                    "舞蹈编导",
                    "戏曲导演",
                    "舞台艺术设计与制作"
                ]
            },
            {
                "key": "民族文化类",
                "value": [
                    "民族文化类",
                    "民族表演艺术",
                    "民族美术",
                    "民族服装与服饰",
                    "民族民居装饰",
                    "民族传统技艺",
                    "少数民族古籍修复",
                    "中国少数民族语言文化"
                ]
            },
            {
                "key": "文化服务类",
                "value": [
                    "文化服务类",
                    "文化创意与策划",
                    "文化市场经营管理",
                    "公共文化服务与管理",
                    "文物修复与保护",
                    "考古探掘技术",
                    "文物博物馆服务与管理",
                    "图书档案管理"
                ]
            }
        ]
    },
    {
        "key": "新闻传播",
        "value": [
            {
                "key": "新闻出版类",
                "value": [
                    "新闻出版类",
                    "图文信息处理",
                    "网络新闻与传播",
                    "版面编辑与校对",
                    "出版商务",
                    "出版与电脑编辑技术",
                    "出版信息管理",
                    "数字出版",
                    "数字媒体设备管理"
                ]
            },
            {
                "key": "广播影视类",
                "value": [
                    "广播影视类",
                    "新闻采编与制作",
                    "播音与主持",
                    "广播影视节目制作",
                    "广播电视技术",
                    "影视制片管理",
                    "影视编导",
                    "影视美术",
                    "影视多媒体技术",
                    "影视动画",
                    "影视照明技术与艺术",
                    "音像技术",
                    "录音技术与艺术",
                    "摄影摄像技术",
                    "传播与策划",
                    "媒体营销"
                ]
            }
        ]
    },
    {
        "key": "教育与体育",
        "value": [
            {
                "key": "教育类",
                "value": [
                    "教育类",
                    "早期教育",
                    "学前教育",
                    "小学教育",
                    "语文教育",
                    "数学教育",
                    "英语教育",
                    "物理教育",
                    "化学教育",
                    "生物教育",
                    "历史教育",
                    "地理教育",
                    "音乐教育",
                    "美术教育",
                    "体育教育",
                    "思想政治教育",
                    "舞蹈教育",
                    "艺术教育",
                    "特殊教育",
                    "科学教育",
                    "现代教育技术",
                    "心理健康教育"
                ]
            },
            {
                "key": "语言类",
                "value": [
                    "语言类",
                    "汉语",
                    "商务英语",
                    "应用英语",
                    "旅游英语",
                    "商务日语",
                    "应用日语",
                    "旅游日语",
                    "应用韩语",
                    "应用俄语",
                    "应用法语",
                    "应用德语",
                    "应用西班牙语",
                    "应用越南语",
                    "应用泰语",
                    "应用阿拉伯语",
                    "应用外语"
                ]
            },
            {
                "key": "文秘类",
                "value": [
                    "文秘类",
                    "文秘",
                    "文秘速录"
                ]
            },
            {
                "key": "体育类",
                "value": [
                    "体育类",
                    "运动训练",
                    "运动防护",
                    "社会体育",
                    "休闲体育",
                    "高尔夫球运动与管理",
                    "民族传统体育",
                    "体育艺术表演",
                    "体育运营与管理",
                    "体育保健与康复",
                    "健身指导与管理"
                ]
            }
        ]
    },
    {
        "key": "公安与司法",
        "value": [
            {
                "key": "公安管理类",
                "value": [
                    "公安管理类",
                    "治安管理",
                    "交通管理",
                    "信息网络安全监察",
                    "防火管理",
                    "边防检查",
                    "边境管理",
                    "特警",
                    "警察管理",
                    "公共安全管理",
                    "森林消防",
                    "部队后勤管理",
                    "部队政治工作"
                ]
            },
            {
                "key": "公安指挥类",
                "value": [
                    "公安指挥类",
                    "警察指挥与战术",
                    "边防指挥",
                    "船艇指挥",
                    "通信指挥",
                    "消防指挥",
                    "参谋业务",
                    "抢险救援"
                ]
            },
            {
                "key": "公安技术类",
                "value": [
                    "公安技术类",
                    "刑事科学技术",
                    "警犬技术"
                ]
            },
            {
                "key": "侦查类",
                "value": [
                    "侦查类",
                    "刑事侦查",
                    "国内安全保卫",
                    "经济犯罪侦查",
                    "禁毒"
                ]
            },
            {
                "key": "法律实务类",
                "value": [
                    "法律实务类",
                    "司法助理",
                    "法律文秘",
                    "法律事务",
                    "检察事务"
                ]
            },
            {
                "key": "法律执行类",
                "value": [
                    "法律执行类",
                    "刑事执行",
                    "民事执行",
                    "行政执行",
                    "司法警务",
                    "社区矫正"
                ]
            },
            {
                "key": "司法技术类",
                "value": [
                    "司法技术类",
                    "刑事侦查技术",
                    "安全防范技术",
                    "司法信息技术",
                    "司法鉴定技术",
                    "司法信息安全",
                    "罪犯心理测量与矫正技术",
                    "戒毒矫治技术",
                    "职务犯罪预防与控制"
                ]
            }
        ]
    },
    {
        "key": "公共管理与服务",
        "value": [
            {
                "key": "公共事业类",
                "value": [
                    "公共事业类",
                    "社会工作",
                    "社会福利事业管理",
                    "青少年工作与管理",
                    "社区管理与服务",
                    "公共关系",
                    "人民武装"
                ]
            },
            {
                "key": "公共管理类",
                "value": [
                    "公共管理类",
                    "民政管理",
                    "人力资源管理",
                    "劳动与社会保障",
                    "网络舆情监测",
                    "公共事务管理",
                    "行政管理",
                    "质量管理与认证",
                    "知识产权管理"
                ]
            },
            {
                "key": "公共服务类",
                "value": [
                    "公共服务类",
                    "老年服务与管理",
                    "家政服务与管理",
                    "婚庆服务与管理",
                    "社区康复",
                    "现代殡葬技术与管理"
                ]
            }
        ]
    },
    {
        "key": "军事学",
        "value": [
            {
                "key": "军事思想及军事历史",
                "value": [
                    "军事思想及军事历史",
                    "军事思想",
                    "军事历史"
                ]
            },
            {
                "key": "战略学",
                "value": [
                    "战略学",
                    "军事战略学",
                    "战争动员学"
                ]
            },
            {
                "key": "战役学",
                "value": [
                    "战役学",
                    "联合战役学",
                    "军种战役学"
                ]
            },
            {
                "key": "战术学",
                "value": [
                    "战术学",
                    "合同战术学",
                    "兵种战术学"
                ]
            },
            {
                "key": "军队指挥学",
                "value": [
                    "军队指挥学",
                    "作战指挥学",
                    "军事运筹学",
                    "军事通信学",
                    "军事情报学",
                    "密码学"
                ]
            },
            {
                "key": "军制学",
                "value": [
                    "军制学",
                    "军事组织编制学",
                    "军队管理学"
                ]
            },
            {
                "key": "军队政治工作学",
                "value": [
                    "军队政治工作学"
                ]
            },
            {
                "key": "军事后勤学",
                "value": [
                    "军事后勤学",
                    "后方专业勤务"
                ]
            },
            {
                "key": "军事装备学",
                "value": [
                    "军事装备学"
                ]
            },
            {
                "key": "军事训练学",
                "value": [
                    "军事训练学"
                ]
            },
            {
                "key": "军事",
                "value": [
                    "军事",
                    "军队政治工作",
                    "军事指挥",
                    "军事后勤",
                    "军事装备"
                ]
            }
        ]
    }
]
